# GetLinkDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkInstance..::..GetLinkDocument Method
RevitLinkInstance Class See Also
---
The document associated with the Revit link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Document GetLinkDocument()
```

Visual Basic
---
```text
Public Function GetLinkDocument As Document
```

Visual C++
---
```text
public:
Document^ GetLinkDocument()
```

# Remarks
Operations that require a transaction or modify the document's status in memory (such as Save and Close) cannot be performed on this document.
# See Also
RevitLinkInstance Class
Autodesk.Revit.DB Namespace